{
  "Back to start": "Yn ôl i’r dechrau",
  "Page Not Found": "Tudalen Heb ei Chanfod",
  "Please contact your Local Council if you need to speak to someone about your food business registration urgently.": "Cysylltwch â'ch Cyngor Lleol os oes angen i chi siarad â rhywun am eich cofrestriad busnes bwyd ar frys.",
  "Return to previous page": "Ewch yn ôl i'r dudalen flaenorol",
  "Will this food business import or export any food from outside the UK?": "A fydd y busnes bwyd hwn yn mewnforio neu'n allforio unrhyw fwyd o du allan i'r Deyrnas Unedig?",
  "This does not include any food imported or exported by other food businesses.": "Nid yw hyn yn cynnwys unrhyw fwyd sy'n cael ei fewnforio neu ei allforio gan fusnesau bwyd eraill.",
  "Select all that apply": "Dewiswch bob un sy’n berthnasol",
  "Directly import food": "Mewnforio bwyd yn uniongyrchol",
  "Directly export food": "Allforio bwyd yn uniongyrchol",
  "No import or export activities": "Dim gweithgareddau mewnforio nac allforio",
  "More information about import and export activities": "Rhagor o wybodaeth am weithgareddau mewnforio ac allforio",
  "If a food business is directly importing or exporting food outside of the UK, there are some extra requirements for the business to follow.": "Os yw busnes bwyd yn mewnforio neu'n allforio bwyd yn uniongyrchol y tu allan i'r Deyrnas Unedig, mae rhai gofynion ychwanegol y mae’n rhaid i'r busnes eu dilyn.",
  "Find out more by visiting the": "Gallwch ddysgu rhagor trwy ymweld â",
  "Food Standards Agency website (opens in new window)": "gwefan yr Asiantaeth Safonau Bwyd (agor mewn ffenestr newydd)",
  "Other details": "Manylion eraill",
  "Is there anything else you need to tell us about this establishment? (optional)": "A oes unrhyw beth arall y mae angen i chi ei ddweud wrthym ni am y sefydliad hwn? (dewisol)",
  "What kind of food business are you registering?": "Pa fath o fusnes bwyd ydych chi'n ei gofrestru?",
  "What type of water supply does this establishment use?": "Pa fath o gyflenwad dŵr mae'r sefydliad hwn yn ei ddefnyddio?",
  "What is an establishment?": "Beth yw sefydliad?",
  "An establishment is the location of your food business, and the food activities taking place there. If it is a mobile food business, please use the location where it is normally stored overnight.": "Sefydliad yw lleoliad eich busnes bwyd, a'r gweithgareddau bwyd sy'n digwydd yno. Os yw'n fusnes bwyd symudol, defnyddiwch y lleoliad lle mae'n cael ei storio dros nos fel rheol.",
  "The water supply is where you get your tap water from. It has a private water supply if it uses water that you take up from the ground by yourself. For example from a well.": "Y cyflenwad dŵr yw lle rydych chi'n cael eich dŵr tap ohono. Mae ganddo gyflenwad dŵr preifat os yw'n defnyddio dŵr rydych chi'n ei gymryd o'r ddaear eich hunain. Er enghraifft o ffynnon.",
  "Mains water supply (most common supply)": "Dŵr o’r prif gyflenwad (cyflenwad mwyaf cyffredin)",
  "Private water supply": "Cyflenwad dŵr preifat",
  "Both mains and private water supplies": "Prif gyflenwad a chyflenwad dŵr preifat",
  "I don't know if I have a private water supply": "Dydw i ddim yn gwybod a oes gen i gyflenwad dŵr preifat",
  "If you are not registered with a water supply company or paying a bill for water, this is an indication that your water supply could be private.": "Os nad ydych chi wedi cofrestru gyda chwmni cyflenwi dŵr nac yn talu bil dŵr, mae hyn yn arwydd y gallai eich cyflenwad dŵr fod yn un preifat.",
  "Operator contact details": "Manylion cyswllt y gweithredwr",
  "Please give us the details of the person at this company or charity we should speak to about food hygiene and safety.": "Nodwch fanylion yr unigolyn yn y cwmni hwn neu'r elusen hon y dylem siarad â nhw am hylendid a diogelwch bwyd.",
  "What is a food business operator?": "Beth yw gweithredwr busnes bwyd?",
  "The operator is the person or people, charity or company who makes the decisions about the food business. They decide what it serves and how it operates.": "Y gweithredwr yw'r person neu'r bobl, yr elusen neu'r cwmni sy'n gwneud y penderfyniadau am y busnes bwyd. Nhw sy'n penderfynu beth mae'n ei wasanaethu a sut mae'n gweithredu.",
  "Name of contact": "Enw'r cyswllt",
  "Role (optional)": "Rôl (dewisol)",
  "Phone number": "Rhif ffôn ",
  "We will use your email to keep you informed of any policy or legal changes that could affect your food business.": "Byddwn yn defnyddio'ch e-bost i roi gwybod i chi am unrhyw newidiadau polisi neu gyfreithiol a allai effeithio ar eich busnes bwyd.",
  "Email address": "Cyfeiriad e-bost",
  "Who will this establishment supply food to?": "I bwy fydd y sefydliad hwn yn cyflenwi bwyd?",
  "The establishment will supply food to other businesses to process, sell or serve": "Bydd y sefydliad yn cyflenwi bwyd i fusnesau eraill i'w brosesu, ei werthu neu ei weini",
  "The establishment will supply food directly to end consumers": "Bydd y sefydliad yn cyflenwi bwyd yn uniongyrchol i ddefnyddwyr terfynol",
  "Declaration": "Datganiad",
  "Review these statements and tick all three boxes to agree.": "Ewch ati i adolygu’r datganiadau hyn a thiciwch y tri blwch i gytuno.",
  "I declare that the information I have given on this form is correct and complete to the best of my knowledge and belief.": "Dyma ddatgan bod yr wybodaeth rydw i wedi’i rhoi ar y ffurflen hon yn gywir ac yn gyflawn hyd eithaf fy ngwybodaeth a'm cred.",
  "The operator will notify their local council of any significant changes to the business activity, including closure, within 28 days of the change happening.": "Bydd y gweithredwr yn rhoi gwybod i’w gyngor lleol am unrhyw newidiadau sylweddol i weithgarwch y busnes, gan gynnwys os yw’r busnes yn cau, o fewn 28 diwrnod ar ôl i'r newid ddigwydd.",
  "The operator understands they are legally responsible for the safety and authenticity of the food being produced or served at this establishment.": "Mae'r gweithredwr yn deall ei fod yn gyfrifol yn gyfreithiol am ddiogelwch a dilysrwydd y bwyd sy'n cael ei gynhyrchu neu ei weini yn y sefydliad hwn.",
  "Feedback": "Adborth",
  "Congratulations, you've almost finished. We want to provide you with the best experience possible and value your feedback.": "Llongyfarchiadau, rydych chi bron â gorffen. Rydym ni eisiau rhoi'r profiad gorau posibl i chi a byddem yn croesawu eich adborth yn fawr.",
  "I agree to be contacted to provide feedback to help develop this service (optional)": "Rydw i'n cytuno y gallwch gysylltu â mi er mwyn holi am adborth er mwyn gallu datblygu'r gwasanaeth hwn (dewisol)",
  "See here(/pdfs/feedback) for details on how we will use your data.": "Cymerwch gip yma (pdfs/adborth) i weld sut y byddwn yn defnyddio'ch data.",
  "What is the establishment's address?": "Beth yw cyfeiriad y sefydliad?",
  "No addresses found for the postcode": "Ni ddaethom o hyd i unrhyw gyfeiriadau ar gyfer y cod post",
  "Please enter your address manually or go back to try a different postcode.": "Rhowch y cyfeiriad i mewn eich hun neu ewch yn ôl i roi cynnig ar god post gwahanol.",
  "Address line 1": "Llinell cyfeiriad 1",
  "Address line 2 (optional)": "Llinell cyfeiriad 2 (dewisol)",
  "Address line 3 (optional)": "Llinell cyfeiriad 3 (dewisol)",
  "Town or city": "Tref neu ddinas",
  "Postcode": "Cod Post",
  "An establishment is the location of your food business. If it is a mobile food business, please use the location where it is normally stored overnight.": "Sefydliad yw lleoliad eich busnes bwyd. Os yw'n fusnes bwyd symudol, defnyddiwch y lleoliad lle mae'n cael ei storio dros nos fel rheol.",
  "Change postcode": "Newid cod post",
  "Select an address for ": "Dewiswch gyfeiriad ar gyfer ",
  "No addresses found": "Ni chafwyd hyd i gyfeiriadau",
  "I can't find my address in the list": "Ni allaf ddod o hyd i'm cyfeiriad yn y rhestr",
  "Where is this establishment located?": "Ble mae'r sefydliad hwn?",
  "In a mobile or moveable premises": "Mewn safle symudol",
  "In a home or domestic premises": "Mewn cartref neu safle domestig",
  "In a commercial or public premises": "Mewn adeilad masnachol neu gyhoeddus",
  "Establishment address": "Cyfeiriad y sefydliad",
  "Establishment contact details": "Manylion cyswllt y sefydliad",
  "Main phone number": "Prif rif ffôn ",
  "Secondary phone number (optional)": "Ail rif ffôn (dewisol)",
  "Is this establishment already trading?": "A yw'r sefydliad hwn yn masnachu yn barod?",
  "It is trading if it is already producing or serving food, or if the new operator has already taken control": "Mae'n masnachu os yw eisoes yn cynhyrchu neu'n gweini bwyd, neu os yw'r gweithredwr newydd eisoes wedi cymryd rheolaeth",
  "Yes, it is already trading": "Ydy, mae eisoes yn masnachu",
  "No, it is not trading yet": "Nac ydy, nid yw'n masnachu eto",
  "Trading name": "Enw masnachu",
  "A trading name is what your customers will call your business.": "Enw masnachu yw’r enw y bydd eich cwsmeriaid yn galw eich busnes.",
  "What is the trading name of this establishment?": "Beth yw enw masnachu'r sefydliad hwn?",
  "Register a food business": "Cofrestru busnes bwyd",
  "When you start a new food business or take over an existing business, you must register with your local authority. You should do this at least **28 days** before trading or before food operations start.": "Pan fyddwch chi'n dechrau busnes bwyd newydd neu'n cymryd yr awenau mewn busnes sy'n bodoli eisoes, mae'n rhaid i chi gofrestru gyda'ch awdurdod lleol. Dylech wneud hyn o leiaf **28 diwrnod** cyn dechrau masnachu neu cyn i weithrediadau bwyd ddechrau.",
  "During this registration, you may come across a few specialist terms, which we have described below": "Wrth fynd ati i gofrestru eich busnes, mae’n bosibl y byddwch yn dod ar draws ambell derm arbenigol. Rydym ni wedi disgrifio’r rhain isod",
  "Food business operator": "Gweithredwr busnes bwyd",
  "The operator is the person, charity or company who makes the decisions about the food business. They decide what it serves and how it operates.": "Y gweithredwr yw'r person, yr elusen neu'r cwmni sy'n gwneud y penderfyniadau am y busnes bwyd. Nhw sy'n penderfynu beth mae'n ei weini a sut mae'n gweithredu.",
  "Establishment": "Sefydliad",
  "The establishment is the location or site of your food business. If it is a mobile food business, please use the location where it is normally stored overnight.": "Y sefydliad yw lleoliad neu safle eich busnes bwyd. Os yw'n fusnes bwyd symudol, defnyddiwch y lleoliad lle mae'n cael ei storio dros nos fel rheol.",
  "Registering Local Authority": "Awdurdod Lleol sy’n cofrestru",
  "is the local authority your registration will be sent to. Is this the correct local authority for your business? If unsure please use this [Food Business Registration](www.gov.uk/food-business-registration) link to check using the location or site of your food business.": "yw'r awdurdod lleol y bydd eich cofrestriad yn cael ei anfon ato. Ai hwn yw'r awdurdod lleol cywir ar gyfer eich busnes? Os ydych chi'n ansicr, defnyddiwch y ddolen [Cofrestru Busnesau Bwyd](https://www.gov.uk/food-business-registration) i wirio gan ddefnyddio lleoliad neu safle eich busnes bwyd.",
  "This service is currently unavailable": "Nid yw'r gwasanaeth hwn ar gael ar hyn o bryd",
  "Sorry about that, we seem to be experiencing some difficulties.": "Mae'n ddrwg gennym ni am hyn, mae'n ymddangos ein bod ni’n cael trafferthion technegol.",
  "Please try again later.": "Rhowch gynnig arall arni'n hwyrach.",
  "Return to food.gov.uk": "Dychwelyd i food.gov.uk",
  "Who is the main point of contact?": "Pwy yw'r prif bwynt cyswllt?",
  "Please select the partner who will be the main point of contact for this business": "Dewiswch y partner a fydd yn brif bwynt cyswllt ar gyfer y busnes hwn",
  "Opening days": "Diwrnodau agor",
  "When will this establishment be open and serving or preparing food?": "Pryd fydd y sefydliad hwn ar agor ac yn gweini neu'n paratoi bwyd?",
  "For example": "Er enghraifft",
  "only serving food during December at Christmas markets": "dim ond yn gweini bwyd yn ystod mis Rhagfyr mewn marchnadoedd Nadolig",
  "open at weekends in June and August": "ar agor ar benwythnosau ym mis Mehefin a mis Awst rhwng 10:00 a 19:00",
  "What days will this establishment be producing or serving food?": "Pa ddyddiau fydd y sefydliad hwn yn cynhyrchu neu'n gweini bwyd?",
  "Monday": "Dydd Llun",
  "Tuesday": "Dydd Mawrth",
  "Wednesday": "Dydd Mercher",
  "Thursday": "Dydd Iau",
  "Friday": "Dydd Gwener",
  "Saturday": "Dydd Sadwrn",
  "Sunday": "Dydd Sul",
  "What days will this establishment be open and producing or serving food?": "Ar ba ddiwrnodau fydd y sefydliad hwn ar agor ac yn cynhyrchu neu'n gweini bwyd?",
  "Every day": "Bob dydd",
  "Some days a week": "Rhai diwrnodau'r wythnos",
  "Irregular days or seasonal": "Diwrnodau afreolaidd neu dymhorol",
  "I don't know what days to select": "Dydw i ddim yn gwybod pa ddiwrnodau i'w dewis",
  "The food business will have irregular opening days if it isn't open the same days every week. This could include seasonal establishments such as summer ice-cream vendors. It can also include establishments which only open for events such as football matches.": "Bydd gan y busnes bwyd ddiwrnodau agor afreolaidd os nad yw’r busnes ar agor ar yr un diwrnodau bob wythnos. Gallai hyn gynnwys sefydliadau tymhorol fel gwerthwyr hufen iâ dros yr haf. Gall hefyd gynnwys sefydliadau sydd ond yn agor ar gyfer digwyddiadau fel gemau pêl-droed.",
  "Opening hours": "Oriau agor",
  "Fill in the expected opening times for this establishment using 24 hour clocks.": "Nodwch yr amseroedd agor disgwyliedig ar gyfer y sefydliad hwn gan ddefnyddio clociau 24 awr. Er enghraifft, 09:30 i 19:00.",
  "Select an address for": "Dewiswch gyfeiriad ar gyfer",
  "Details of the operating charity, organisation or trust": "Manylion yr elusen, y sefydliad neu'r ymddiriedolaeth sy’n gweithredu’r busnes",
  "Charity, organisation or trust name": "Enw’r elusen, y sefydliad neu’r ymddiriedolaeth",
  "Charity reference number (optional)": "Rif cyfeirnod elusen (dewisol)",
  "Questions about charity reference numbers": "Cwestiynau am rifau cyfeirnod elusennau",
  "Charities that are registered with the Charities Commission will have a charity reference number. You can find your charity reference number by visiting the": "Bydd gan elusennau sydd wedi'u cofrestru gyda'r Comisiwn Elusennau rif cyfeirnod elusen. Gallwch ddod o hyd i'ch rhif chi trwy ymweld â",
  "Charity Commission website (opens in new window)": "Gwefan y Comisiwn Elusennau (agor mewn ffenestr newydd)",
  "Company details": "Manylion y cwmni",
  "The name of the registered company that is acting as the operator of this food business.": "Enw'r cwmni cofrestredig sy'n gweithredu fel gweithredwr y busnes bwyd hwn.",
  "Registered company name": "Enw'r cwmni cofrestredig",
  "Every registered company will have a Companies House reference number.": "Bydd gan bob cwmni cofrestredig rif cyfeirnod Tŷ'r Cwmnïau.",
  "Companies House number": "Rhif Tŷ'r Cwmnïau",
  "I don't know my Companies House number": "Dydw i ddim yn gwybod fy rhif Tŷ’r Cwmnïau",
  "Every limited company has to be registered with Companies House, and will have a company reference number. You can find your company reference number by visiting the": "Rhaid i bob cwmni cyfyngedig fod wedi'i gofrestru gyda Thŷ'r Cwmnïau, a bydd ganddo gyfeirnod cwmni. Gallwch ddod o hyd i'ch cyfeirnod cwmni trwy ymweld â",
  "Companies House website (opens in new window)": "Gwefan Tŷ'r Cwmnïau (agor mewn ffenestr newydd)",
  "Partnership contact details": "Manylion cyswllt y bartneriaeth",
  "What is the operator's name?": "Beth yw enw'r gweithredwr?",
  "First and middle names": "Enwau cyntaf a chanol",
  "Last name": "Cyfenw",
  "Who operates this business?": "Pwy sy'n gweithredu'r busnes hwn?",
  "The food business is owned or operated by a person": "Person sy'n berchen ar y busnes bwyd neu sy'n ei weithredu",
  "The food business is owned or operated by a limited company": "Cwmni cyfyngedig sy'n berchen ar y busnes bwyd neu sy'n ei weithredu",
  "The food business is owned or operated by a charity, organisation or trust": "Elusen, sefydliad neu ymddiriedolaeth sy'n berchen ar y busnes bwyd neu sy'n ei weithredu",
  "Add partner's name": "Ychwanegwch enw'r partner",
  "Edit partner's name": "Golygu enw'r partner",
  "Full name": "Enw llawn",
  "Save partner": "Arbed partner",
  "Add partner": "Ychwanegu partner",
  "Cancel": "Canslo",
  "What are the partners' names?": "Beth yw enwau'r partneriaid?",
  "Please advise your local authority directly if more than 5 partners are responsible for this food business": "Rhowch wybod i'ch awdurdod lleol yn uniongyrchol os oes mwy na 5 partner yn gyfrifol am y busnes bwyd hwn",
  "What is your role in this food business?": "Beth yw eich rôl yn y busnes bwyd hwn?",
  "I operate it as a sole trader": "Rydw i’n ei weithredu fel unig fasnachwr",
  "I operate it in a partnership": "Rydw i’n weithredu mewn partneriaeth",
  "I represent a person, charity, limited company (Ltd), organisation or trust that operates it": "Rydw i’n cynrychioli person, elusen, cwmni cyfyngedig (Cyf), sefydliad neu ymddiriedolaeth sy'n ei weithredu",
  "Check your answers": "Gwiriwch eich atebion",
  "You must check your answers before you continue": "Rhaid i chi wirio'ch atebion cyn i chi barhau",
  "Submission complete": "Wedi gorffen cyflwyno’r wybodaeth",
  "Thank you for submitting your food business registration.": "Diolch i chi am gyflwyno eich cofrestriad busnes bwyd.",
  "Your unique food business registration application reference is": "Eich cyfeirnod unigryw ar gyfer eich cais i gofrestru busnes bwyd yw",
  "Registration submitted": "Cofrestriad wedi’i gyflwyno",
  "Awaiting registration application reference": "Aros am gyfeirnod cais cofrestru",
  "Please keep note of this registration application reference for your records.": "Cofiwch gadw nodyn o'r cyfeirnod cais cofrestru hwn ar gyfer eich cofnodion.",
  "Submitted on": "Cyflwynwyd ar",
  "Your registration has been sent to": "Anfonwyd eich cofrestriad at:",
  "Responsible local council for food hygiene": "Cyngor lleol sy’n gyfrifol am hylendid bwyd",
  "Responsible local council for food standards": "Cyngor lleol sy’n gyfrifol am safonau bwyd",
  "A copy of this registration has been sent to ": "Anfonwyd copi o'r cofrestriad hwn at ",
  "What's next?": "Beth fydd yn digwydd nesaf?",
  "**You may receive an unannounced food inspection from your local council soon after you start trading.**": "**Efallai y byddwch chi’n cael arolygiad bwyd dirybudd gan eich cyngor lleol yn fuan ar ôl i chi ddechrau masnachu.**",
  "The council may contact you before the inspection to discuss how your business operates or to offer advice. Meanwhile, there are some things you can do to help prepare for the opening of your business.": "Efallai y bydd y cyngor yn cysylltu â chi cyn yr arolygiad i drafod sut mae'ch busnes yn gweithredu neu i gynnig cyngor. Yn y cyfamser, mae ambell beth y gallwch chi eu gwneud er mwyn paratoi ar gyfer agor eich busnes.",
  "Find out here what you can do to prepare": "Dyma ragor o wybodaeth am beth allwch chi ei wneud i baratoi:",
  "All links open in a new window": "Mae'r holl ddolenni'n agor mewn ffenestr newydd",
  "English": "Saesneg",
  "Guidance on food hygiene and how to run a safe food business": "Canllawiau ar hylendid bwyd a sut i redeg busnes bwyd diogel",
  "How to achieve a high food hygiene rating (FHRS score)": "Sut i gael sgôr hylendid bwyd uchel",
  "Safe catering": "Safe catering",
  "Information on the food safety management system safer food, better business": "Gwybodaeth am y system rheoli diogelwch bwyd, Bwyd mwy diogel, busnes gwell",
  "Food labelling and allergens guidance": "Canllawiau labelu bwyd ac alergenau",
  "Business support": "Cymorth busnes",
  "Business support & helpline": "Llinell gymorth ar gyfer busnesau",
  "or contact the Business Support Helpline on 0300 456 3565": "neu cysylltwch â'r Llinell Gymorth ar gyfer Busnesau ar 0300 456 3565",
  "Your registration details": "Eich manylion cofrestru:",
  "What is the partnership contact's address?": "Beth yw cyfeiriad cyswllt y bartneriaeth?",
  "Partnership address is the contact address for the partner who is the main point of contact.": "Cyfeiriad y bartneriaeth yw'r cyfeiriad cyswllt ar gyfer y partner sy'n brif bwynt cyswllt.",
  "What is the operator's address?": "Beth yw cyfeiriad y gweithredwr?",
  "Operator address is the contact address for the operator. For example home address for a sole trader or headquarters address for a limited company.": "Cyfeiriad y gweithredwr yw cyfeiriad cyswllt y gweithredwr. Er enghraifft cyfeiriad cartref ar gyfer unig fasnachwr neu gyfeiriad pencadlys ar gyfer cwmni cyfyngedig.",
  "Back": "Yn ôl",
  "Your web browser": "Mae eich porwr gwe...wedi dyddio. Efallai na fyddwch yn gallu cwblhau'r cofrestriad. Ewch ati i ddiweddaru eich porwr i sicrhau gwell diogelwch, cyflymder a'r profiad gorau ar y wefan hon.",
  "is out of date. You may not be able to complete the registration. Update your browser for more security, speed and the best experience on this site.": "wedi dyddio. Efallai na fyddwch yn gallu cwblhau'r cofrestriad. Ewch ati i ddiweddaru eich porwr i sicrhau gwell diogelwch, cyflymder a'r profiad gorau ar y wefan hon.",
  "Search with your own keywords and then select the most fitting business type from the suggestions": "Chwiliwch gyda'ch geiriau allweddol eich hun ac yna dewiswch y math busnes mwyaf addas o'r awgrymiadau",
  "cafe": "caffi",
  "food delivery service": "gwasanaeth dosbarthu bwyd",
  "commercial bakery": "popty / becws / siop fara masnachol",
  "meat product manufacturer": "gweithgynhyrchwr cynnyrch cig",
  "Select business type": "Dewiswch y math o fusnes",
  "business type autocomplete, type and then choose from results": "awto-gwblhau math busnes, teipiwch ac yna dewiswch o'r canlyniadau",
  "Contact details for the main point of contact for this business": "Manylion cyswllt ar gyfer prif bwynt cyswllt y busnes hwn",
  "Begin registration": "Dechreuwch gofrestru",
  "Submit": "Cyflwyno",
  "Save amd continue": "Arbed a parhau",
  "Continue": "Parhau",
  "Register a food business uses a cookie to create the registration. We also use optional cookies to analyse how the service is performing. We do not share any information with advertisers or social media platforms. We do not store any information about you in the cookie.": "Mae’r gwasanaeth Cofrestru Busnesau Bwyd yn defnyddio cwci i greu'r cofrestriad. Rydym ni hefyd yn defnyddio cwcis dewisol i ddadansoddi sut mae'r gwasanaeth yn perfformio. Nid ydym ni’n rhannu unrhyw wybodaeth â hysbysebwyr nac unrhyw gyfryngau cymdeithasu. Nid ydym ni’n storio unrhyw wybodaeth amdanoch chi yn y cwci.",
  "find out more about cookies (opens in new window)": "dysgwch ragor am gwcis (agor mewn ffenestr newydd)",
  "Find out more about cookies": "Rhagor o wybodaeth am gwcis",
  "Read our cookie policy": "Darllenwch ein polisi cwcis",
  "I do not accept optional cookies": "Dydw i ddim yn derbyn cwcis dewisol",
  "I accept cookies": "Rydw i yn derbyn cwcis",
  "Search and select the most fitting business type from the suggestions": "Ewch ati i chwilio a dewis y math busnes mwyaf addas o'r awgrymiadau",
  "Find address": "Dewch o hyd i gyfeiriad",
  "cookie policy (opens in a new window)": "polisi cwcis (agor mewn ffenestr newydd)",
  "Cookies": "Cwcis",
  "privacy policy (opens in a new window)": "polisi preifatrwydd (agor mewn ffenestr newydd)",
  "Privacy": "Preifatrwydd",
  "give us feedback on the service (opens in a new window)": "rhowch adborth i ni ar y gwasanaeth (agor mewn ffenestr newydd)",
  "accessibility statement (opens in a new window)": "datganiad hygyrchedd (agor mewn ffenestr newydd)",
  "Accessibility": "Hygyrchedd ",
  "food.gov.uk website (opens in new window)": "gwefan food.gov.uk/cy (agor mewn ffenestr newydd)",
  "Register a Food Business": "Cofrestru Busnesau Bwyd",
  "cookie banner": "baner cwci",
  "This is a new service": "Mae hwn yn wasanaeth newydd",
  "your feedback (opens in new window)": "eich adborth (yn agor mewn ffenestr newydd)",
  "your feedback": "bydd eich adborth",
  "will help us improve it": "yn ein helpu i'w wella",
  "Additional information": "Gwybodaeth ychwanegol",
  "Trading date": "Dyddiad masnachu",
  "Establishments begin trading when they first start serving or manufacturing food for customers.": "Mae sefydliadau'n dechrau masnachu pan fyddant yn dechrau gweini neu weithgynhyrchu bwyd i gwsmeriaid am y tro cyntaf.",
  "day": "diwrnod",
  "month": "mis",
  "year": "blwyddyn",
  "When is this establishment expected to begin trading?": "Pryd mae disgwyl i'r sefydliad ddechrau masnachu?",
  "I don't know when this establishment will begin trading": "Dydw i ddim yn gwybod pryd y bydd y sefydliad yn dechrau masnachu",
  "Food businesses are required to register at least 28 days before they begin trading. If you are not sure when this business will open, it may be too early to register. You can also use an estimated date.": "Mae'n ofynnol i fusnesau bwyd gofrestru o leiaf 28 diwrnod cyn iddynt ddechrau masnachu. Os nad ydych yn siŵr pryd fydd y busnes hwn yn agor, gallai fod yn rhy gynnar i gofrestru. Gallwch hefyd amcangyfrif dyddiad.",
  "What date did this establishment begin trading?": "Pa ddyddiad y dechreuodd y sefydliad fasnachu?",
  "I don't know when this establishment began trading": "Dydw i ddim yn gwybod pryd y dechreuodd y sefydliad fasnachu",
  "Trading begins the day your business started to serve or make food. Alternatively, it can be the day you took over the business as an operator. If you do not remember the exact date, use an estimated date.": "Mae masnachu yn cychwyn y diwrnod y dechreuodd eich busnes weini neu wneud bwyd. Fel arall, gall fod y diwrnod y gwnaethoch chi gymryd awennau’r busnes fel gweithredwr. Os nad ydych chi’n cofio'r union ddyddiad, gallwch amcangyfrif y dyddiad.",
  "Import/Export": "Mewnforio/Allforio",
  "Other Details": "Manylion eraill",
  "Business Type": "Y math o fusnes",
  "Water Supply": "Cyflenwad dŵr",
  "Contact Details": "Manylion cyswllt",
  "Type of Customer": "Math o gwsmer",
  "Establishment Address": "Cyfeiriad y sefydliad",
  "Establishment Address Type": "Math o gyfeiriad (y sefydliad)",
  "Establishment Contact Details": "Manylion cyswllt y sefydliad",
  "Opening Date": "Dyddiad agor",
  "Opening Status": "Statws agor",
  "Trading Name": "Enw masnachu",
  "Point of Contact": "Pwynt cyswllt",
  "Opening Days": "Diwrnodau agor",
  "Opening Hours": "Oriau agor",
  "Operator Address": "Cyfeiriad y gweithredwr",
  "Details": "Manylion",
  "Company Details": "Manylion y cwmni",
  "Operator Contact Details": "Manylion cyswllt y gweithredwr",
  "Re-use operator contact details": "Ail-ddefnyddio manylion cyswllt y gweithredwr",
  "Re-use partnership contact details": "Ail-ddefnyddio manylion cyswllt y partneriaeth",
  "Operator Name": "Enw’r gweithredwr",
  "Operator Type": "Math o weithredwr",
  "Partner Details": "Manylion partner",
  "Partners": "Partneriaid",
  "Your Role": "Eich rôl ",
  "Registration Summary": "Crynodeb cofrestru",
  "Confirmation": "Cadarnhad",
  "What is a partnership?": "Beth yw partneriaeth?",
  "In a partnership, you and your partner (or partners) personally share responsibility for your food business": "Mewn partneriaeth, rydych chi a'ch partner (neu bartneriaid) yn rhannu cyfrifoldeb am eich busnes bwyd yn bersonol",
  "Change partner name": "Newid enw partner",
  "Change": "Newid",
  "Delete partner": "Dileu partner",
  "There is a problem": "Mae yna broblem",
  "Select the most fitting business type from the suggestions": "Dewiswch y math busnes mwyaf addas o'r awgrymiadau",
  "business type select, click and choose from dropdown": "dewis math busnes, clicio a dewis o'r gwymplen",
  "There was a problem submitting the registration": "Roedd problem wrth gyflwyno'r cofrestriad",
  "Operator type": "Math o weithredwr",
  "Company name": "Enw'r cwmni",
  "Charity name": "Enw’r elusen",
  "Charity number": "Rhif elusen",
  "Name": "Enw",
  "Change operator type": "Newid y math o weithredwr",
  "Change operator company name": "Newid enw cwmni’r gweithredwr",
  "Change operator companies house": "Newid cyfeirnod tŷ cwmnïau’r gweithredwr",
  "Change operator charity name2": "Newid enw elusen gweithredwr2",
  "Change operator charity number": "Newid rhif elusen gweithredwr",
  "Change operator name": "Newid enw'r gweithredwr",
  "Change operator address": "Newid cyfeiriad y gweithredwr",
  "Partnership": "Partneriaeth",
  "Partnership contact address": "Cyfeiriad cyswllt y bartneriaeth",
  "Operator address": "Cyfeiriad y gweithredwr",
  "Main partnership contact": "Prif gyswllt y bartneriaeth",
  "Designated contact": "Cyswllt dynodedig",
  "Change operator contact details": "Newid manylion cyswllt y gweithredwr",
  "Change operator email": "Newid e-bost y gweithredwr",
  "Change main partnership contact": "Newid prif gyswllt y bartneriaeth",
  "Change partner details": "Newid manylion partner",
  "Change contact representative": "Newid cynrychiolydd cyswllt",
  "Address type": "Math o gyfeiriad",
  "Change establishment trading name": "Newid enw masnachu’r sefydliad",
  "Change establishment address": "Newid cyfeiriad y sefydliad",
  "Change establishment address type": "Newid math o gyfeiriad y sefydliad",
  "Change establishment contact details": "Newid manylion cyswllt y sefydliad",
  "Change establishment email": "Newid e-bost y sefydliad",
  "Water supply": "Cyflenwad dŵr",
  "Customers": "Cwsmeriaid",
  "Business type": "Math o fusnes",
  "Change establishment opening date": "Newid dyddiad agor y sefydliad",
  "Change establishment opening days": "Newid diwrnodau agor y sefydliad",
  "Change establishment opening hours": "Newid oriau agor y sefydliad",
  "Change water supply": "Newid cyflenwad dŵr",
  "Change activities customer type": "Newid math cwsmer gweithgareddau ",
  "Change business type": "Newid math busnes",
  "Invalid date": "Dyddiad annilys",
  "Irregular days": "Diwrnodau afreolaidd",
  "Import and export": "Mewnforio ac allforio",
  "Additional details": "Manylion ychwanegol",
  "Change business activities import export": "Newid gweithgareddau busnes mewnforio allforio",
  "Change business other details": "Newid manylion busnes eraill",
  "Operator details": "Manylion gweithredwr",
  "Establishment details": "Manylion y sefydliad",
  "Activities": "Gweithgareddau",
  "You must tick all the declarations before continuing": "Rhaid i chi dicio'r holl ddatganiadau cyn parhau",
  "You must select a role before continuing": "Rhaid i chi ddewis rôl cyn parhau",
  "You must select an operator type before continuing": "Rhaid i chi ddewis math o weithredwr cyn parhau",
  "Not a valid first name": "Ddim yn enw cyntaf dilys",
  "Not a valid last name": "Ddim yn gyfenw dilys",
  "Not a valid town name": "Ddim yn enw tref dilys",
  "Not a valid first line of address": "Nid yw llinell gyntaf y cyfeiriad yn ddilys",
  "Not a valid second line of address": "Nid yw ail linell y cyfeiriad yn ddilys",
  "Not a valid third line of address": "Nid yw trydedd llinell y cyfeiriad yn ddilys",
  "Not a valid postcode": "Ddim yn god post dilys",
  "Not a valid establishment trading name": "Ddim yn enw masnachu sefydliad dilys",
  "Not a valid operator phone number": "Ddim yn rhif ffôn gweithredwr dilys",
  "Not a valid operator email address": "Ddim yn gyfeiriad e-bost gweithredwr dilys",
  "Not a valid representative name": "Ddim yn enw cynrychioliadol dilys",
  "Not a valid representative role": "Ddim yn rôl gynrychioliadol ddilys",
  "Not a valid representative phone number": "Ddim yn rhif ffôn cynrychioliadol dilys",
  "Not a valid representative email address": "Ddim yn gyfeiriad e-bost cynrychioliadol dilys",
  "Not a valid company name": "Ddim yn enw cwmni dilys",
  "Not a valid Companies House reference number": "Ddim yn gyfeirnod Tŷ'r Cwmnïau dilys",
  "Not a valid charity, organisation or trust name": "Ddim yn enw elusen, sefydliad nac ymddiriedolaeth dilys",
  "Not a valid charity number": "Ddim yn rhif elusen dilys",
  "Not a valid establishment phone number": "Ddim yn rhif ffôn sefydliad dilys",
  "Not a valid establishment email address": "Ddim yn gyfeiriad e-bost sefydliad dilys",
  "You must select an establishment address type before continuing": "Rhaid i chi ddewis math o gyfeiriad sefydliad cyn parhau",
  "You must select a trading status before continuing": "Rhaid i chi ddewis statws masnachu cyn parhau",
  "Not a valid opening date": "Ddim yn ddyddiad agor dilys",
  "You must select a customer type before continuing": "Rhaid i chi ddewis math o gwsmer cyn parhau",
  "You must select a valid import or export option(s) before continuing": "Rhaid i chi ddewis dewis(iadau) mewnforio neu allforio dilys cyn parhau",
  "You must select a business type before continuing": "Rhaid i chi ddewis math o fusnes cyn parhau",
  "You must select a water supply type before continuing": "Rhaid i chi ddewis math o gyflenwad dŵr cyn parhau",
  "Your message is too long. Please shorten it to less than 1500 characters": "Mae eich neges yn rhy hir. A fyddech cystal â’i chwtogi i lai na 1500 nod",
  "Please select which days this establishment is open": "Dewiswch pa diwrnodau mae'r sefydliad hwn ar agor",
  "Please describe when this establishment is open": "Disgrifiwch pryd mae'r sefydliad hwn ar agor",
  "Not a valid name": "Ddim yn enw dilys",
  "Please define between ...partners": "Diffiniwch rhwng ... partneriaid",
  "You must select the main partnership contact before continuing": "Rhaid i chi ddewis prif gyswllt y bartneriaeth cyn parhau",
  "Main partnership contact is not in the list of partners": "Nid yw prif gyswllt y bartneriaeth yn y rhestr o bartneriaid",
  "Invalid opening hours on Monday": "Oriau agor annilys ar ddydd Llun",
  "Invalid opening hours on Tuesday": "Oriau agor annilys ar ddydd Mawrth",
  "Invalid opening hours on Wednesday": "Oriau agor annilys ar ddydd Mercher",
  "Invalid opening hours on Thursday": "Oriau agor annilys ar ddydd Iau",
  "Invalid opening hours on Friday": "Oriau agor annilys ar ddydd Gwener",
  "Invalid opening hours on Saturday": "Oriau agor annilys ar ddydd Sadwrn",
  "Invalid opening hours on Sunday": "Oriau agor annilys ar ddydd Sul",
  "Other businesses": "Fusnesau eraill",
  "End consumer": "Yn uniongyrchol i ddefnyddwyr",
  "End consumer and other businesses": "Yn uniongyrchol i ddefnyddwyr a fusnesau eraill",
  "Place of business or commercial premises": "Mewn adeilad masnachol neu gyhoeddus",
  "Mobile or moveable premises": "Mewn safle symudol",
  "Home or domestic premises": "Mewn cartref neu safle domestig",
  "Directly import": "Mewnforio bwyd yn uniongyrchol",
  "Directly export": "Allforio bwyd yn uniongyrchol",
  "Directly import and export": "Mewnforio ac allforio",
  "None": "Dim gweithgareddau mewnforio nac allforio",
  "Sole trader": "Unig fasnachwr",
  "A person (registered by a representative)": "Person sy'n berchen ar y busnes bwyd neu sy'n ei weithredu",
  "A company (registered by a representative)": "Cwmni cyfyngedig sy'n berchen ar y busnes bwyd neu sy'n ei weithredu",
  "A charity (registered by a representative)": "Elusen, sefydliad neu ymddiriedolaeth sy'n berchen ar y busnes bwyd neu sy'n ei weithredu",
  "Public": "Dŵr o’r prif gyflenwad",
  "Private": "Cyflenwad dŵr preifat",
  "Public and private": "Prif gyflenwad a chyflenwad dŵr preifat",
  "Day": "Diwrnod",
  "Month": "Mis",
  "Year": "Blwyddyn",
  "[Details on how we use your data](/pdfs/feedback)": "[Manylion o ran sut ydym ni’n defnyddio'ch data](/pdfs/feedback)",
  "This service is also available in": "Mae’r gwasanaeth hwn hefyd ar gael yn",
  "en": "cy",
  "Enter answer": "Nodwch yr ateb",
  "Accepted": "Derbyniwyd",
  "You have entered an invalid number of partners or a duplicate partner name. Please define between 2-5 partners, using initials or middle name to ensure that each entry is unique.": "Rydych chi wedi nodi nifer annilys o bartneriaid neu enw partner dyblyg. Diffiniwch rhwng 2 a 5 partner, gan ddefnyddio llythrennau cyntaf eu henwau neu enw canol i sicrhau bod pob cofnod yn unigryw.",
  "Please use initials or middle names as necessary to ensure each partner name is unique.": "Defnyddiwch lythrennau cyntaf enwau neu enwau canol i sicrhau bod enw pob partner yn unigryw."
}
