{
  "There is a problem": "Mae yna broblem",
  "Error You must tick all the declarations before continuing": "Rhaid i chi dicio'r holl ddatganiadau cyn parhau",
  "Error You must select a role before continuing": "Rhaid i chi ddewis rôl cyn parhau",
  "Error You must select an operator type before continuing": "Rhaid i chi ddewis math o weithredwr cyn parhau",
  "Error Not a valid first name": "Ddim yn enw cyntaf dilys",
  "Error Not a valid last name": "Ddim yn gyfenw dilys",
  "Error Not a valid town name": "Ddim yn enw tref dilys",
  "Error Not a valid first line of address": "Nid yw llinell gyntaf y cyfeiriad yn ddilys",
  "Error Not a valid second line of address": "Nid yw ail linell y cyfeiriad yn ddilys",
  "Error Not a valid third line of address": "Nid yw trydedd llinell y cyfeiriad yn ddilys",
  "Error Not a valid postcode": "Ddim yn god post dilys",
  "Error Not a valid establishment trading name": "Ddim yn enw masnachu sefydliad dilys",
  "Error Not a valid operator phone number": "Ddim yn rhif ffôn gweithredwr dilys",
  "Error Not a valid operator email address": "Ddim yn gyfeiriad e-bost gweithredwr dilys",
  "Error Not a valid representative name": "Ddim yn enw cynrychioliadol dilys",
  "Error Not a valid representative role": "Ddim yn rôl gynrychioliadol ddilys",
  "Error Not a valid representative phone number": "Ddim yn rhif ffôn cynrychioliadol dilys",
  "Error Not a valid representative email address": "Ddim yn gyfeiriad e-bost cynrychioliadol dilys",
  "Error Not a valid company name": "Ddim yn enw cwmni dilys",
  "Error Not a valid Companies House reference number": "Ddim yn gyfeirnod Tŷ'r Cwmnïau dilys",
  "Error Not a valid charity, organisation or trust name": "Ddim yn enw elusen, sefydliad nac ymddiriedolaeth dilys",
  "Error Not a valid charity number": "Ddim yn rhif elusen dilys",
  "Error Not a valid establishment phone number": "Ddim yn rhif ffôn sefydliad dilys",
  "Error Not a valid establishment email address": "Ddim yn gyfeiriad e-bost sefydliad dilys",
  "Error You must select an establishment address type before continuing": "Rhaid i chi ddewis math o gyfeiriad sefydliad cyn parhau",
  "Error You must select a trading status before continuing": "Rhaid i chi ddewis statws masnachu cyn parhau",
  "Error Not a valid opening date": "Ddim yn ddyddiad agor dilys",
  "Error You must select a customer type before continuing": "Rhaid i chi ddewis math o gwsmer cyn parhau",
  "Error You must select a valid import or export option(s) before continuing": "Rhaid i chi ddewis dewis(iadau) mewnforio neu allforio dilys cyn parhau",
  "Error You must select a business type before continuing": "Rhaid i chi ddewis math o fusnes cyn parhau",
  "Error You must select a water supply type before continuing": "Rhaid i chi ddewis math o gyflenwad dŵr cyn parhau",
  "Error Your message is too long. Please shorten it to less than 1500 characters": "Mae eich neges yn rhy hir. A fyddech cystal â’i chwtogi i lai na 1500 nod",
  "Error Please select which days this establishment is open": "Dewiswch pa diwrnodau mae'r sefydliad hwn ar agor",
  "Error Please describe when this establishment is open": "Disgrifiwch pryd mae'r sefydliad hwn ar agor",
  "Error Not a valid name": "Ddim yn enw dilys",
  "Error You must select the main partnership contact before continuing": "Rhaid i chi ddewis prif gyswllt y bartneriaeth cyn parhau",
  "Error Main partnership contact is not in the list of partners": "Nid yw prif gyswllt y bartneriaeth yn y rhestr o bartneriaid",
  "Error Invalid opening hours on Monday": "Oriau agor annilys ar ddydd Llun",
  "Error Invalid opening hours on Tuesday": "Oriau agor annilys ar ddydd Mawrth",
  "Error Invalid opening hours on Wednesday": "Oriau agor annilys ar ddydd Mercher",
  "Error Invalid opening hours on Thursday": "Oriau agor annilys ar ddydd Iau",
  "Error Invalid opening hours on Friday": "Oriau agor annilys ar ddydd Gwener",
  "Error Invalid opening hours on Saturday": "Oriau agor annilys ar ddydd Sadwrn",
  "Error Invalid opening hours on Sunday": "Oriau agor annilys ar ddydd Sul",
  "Error You have entered an invalid number of partners or a duplicate partner name. Please define between 2-5 partners, using initials or middle name to ensure that each entry is unique.": "Rydych chi wedi nodi nifer annilys o bartneriaid neu enw partner dyblyg. Diffiniwch rhwng 2 a 5 partner, gan ddefnyddio llythrennau cyntaf eu henwau neu enw canol i sicrhau bod pob cofnod yn unigryw."
}
