{
  "Register a Food Business": "Cofrestru Busnesau Bwyd",
  "Register a Food Business - Will this food business import or export any food from outside the UK?": "Cofrestru Busnesau Bwyd - A fydd y busnes bwyd hwn yn mewnforio neu'n allforio unrhyw fwyd o du allan i'r Deyrnas Unedig?",
  "Register a Food Business - Other details": "Cofrestru Busnesau Bwyd - Manylion eraill",
  "Register a Food Business - What kind of food business are you registering?": "Cofrestru Busnesau Bwyd - Pa fath o fusnes bwyd ydych chi'n ei gofrestru?",
  "Register a Food Business - What type of water supply does this establishment use?": "Cofrestru Busnesau Bwyd - Pa fath o gyflenwad dŵr mae'r sefydliad hwn yn ei ddefnyddio?",
  "Register a Food Business - Contact details": "Cofrestru Busnesau Bwyd - Manylion cyswllt",
  "Register a Food Business - Who will this establishment supply food to?": "Cofrestru Busnesau Bwyd - I bwy fydd y sefydliad hwn yn cyflenwi bwyd?",
  "Register a Food Business - Declaration": "Cofrestru Busnesau Bwyd - Datganiad",
  "Register a Food Business - Establishment postcode": "Cofrestru Busnesau Bwyd - Cod post sefydliad ",
  "Register a Food Business - What is the establishment's address?": "Cofrestru Busnesau Bwyd - Beth yw cyfeiriad y sefydliad?",
  "Register a Food Business - Establishment address": "Cofrestru Busnesau Bwyd - Cyfeiriad y Sefydliad",
  "Register a Food Business - Where is this establishment located?": "Cofrestru Busnesau Bwyd - Ble mae'r sefydliad hwn?",
  "Register a Food Business - Establishment contact details": "Cofrestru Busnesau Bwyd - Manylion cyswllt y sefydliad",
  "Register a Food Business - Expected opening date": "Cofrestru Busnesau Bwyd - Dyddiad agor disgwyliedig",
  "Register a Food Business - Opening date": "Cofrestru Busnesau Bwyd - Dyddiad agor",
  "Register a Food Business - Is this establishment already trading?": "Cofrestru Busnesau Bwyd - A yw'r sefydliad hwn yn masnachu yn barod?",
  "Register a Food Business - Trading name": "Cofrestru Busnesau Bwyd - Enw masnachu",
  "Register a Food Business - Who is the main point of contact?": "Cofrestru Busnesau Bwyd - Pwy yw'r prif bwynt cyswllt?",
  "Register a Food Business - Opening periods": "Cofrestru Busnesau Bwyd - Cyfnodau agor",
  "Register a Food Business - Opening days": "Cofrestru Busnesau Bwyd - Diwrnodau agor",
  "Register a Food Business - What days will this establishment be open and producing or serving food?": "Cofrestru Busnesau Bwyd - Ar ba ddiwrnodau fydd y sefydliad hwn ar agor ac yn cynhyrchu neu'n gweini bwyd?",
  "Register a Food Business - Opening hours": "Cofrestru Busnesau Bwyd - Oriau agor",
  "Register a Food Business - Operator postcode": "Cofrestru Busnesau Bwyd - Cod post gweithredwr",
  "Register a Food Business - What is the operator's address?": "Cofrestru Busnesau Bwyd - Beth yw cyfeiriad y gweithredwr?",
  "Register a Food Business - Operator address": "Cofrestru Busnesau Bwyd - Cyfeiriad y gweithredwr",
  "Register a Food Business - Details of the operating charity, organisation or trust": "Cofrestru Busnesau Bwyd - Manylion yr elusen, y sefydliad neu'r ymddiriedolaeth sy’n gweithredu’r busnes",
  "Register a Food Business - Company details": "Cofrestru Busnesau Bwyd - Manylion y cwmni",
  "Register a Food Business - Operator Contact details": "Cofrestru Busnesau Bwyd - Manylion cyswllt y gweithredwr",
  "Register a Food Business - What is the operator's name?": "Cofrestru Busnesau Bwyd - Beth yw enw'r gweithredwr?",
  "Register a Food Business - Who operates this business?": "Cofrestru Busnesau Bwyd - Pwy sy'n gweithredu'r busnes hwn?",
  "Register a Food Business - Partner details": "Cofrestru Busnesau Bwyd - Manylion partner",
  "Register a Food Business - What are the partners' names?": "Cofrestru Busnesau Bwyd - Beth yw enwau'r partneriaid?",
  "Register a Food Business - What is your role in this food business?": "Cofrestru Busnesau Bwyd - Beth yw eich rôl yn y busnes bwyd hwn?",
  "Register a Food Business - Check your answers": "Cofrestru Busnesau Bwyd - Gwiriwch eich atebion",
  "Register a Food Business - Submission complete": "Cofrestru Busnesau Bwyd - Wedi gorffen cyflwyno’r wybodaeth"
}
