{
  "There is a problem": "There is a problem",
  "Error You must tick all the declarations before continuing": "You must tick all the declarations before continuing",
  "Error You must select a role before continuing": "You must select a role before continuing",
  "Error You must select an operator type before continuing": "You must select an operator type before continuing",
  "Error Not a valid first name": "Not a valid first name",
  "Error Enter a valid first name": "Enter a valid first name",
  "Error Not a valid last name": "Not a valid last name",
  "Error Enter a valid last name": "Enter a valid last name",
  "Error Not a valid town name": "Not a valid town name",
  "Error Not a valid first line of address": "Not a valid first line of address",
  "Error Not a valid second line of address": "Not a valid second line of address",
  "Error Not a valid third line of address": "Not a valid third line of address",
  "Error Not a valid postcode": "Not a valid postcode",
  "Error Not a valid establishment trading name": "Not a valid establishment trading name",
  "Error Not a valid operator phone number": "Not a valid operator phone number",
  "Error Not a valid operator email address": "Not a valid operator email address",
  "Error Not a valid representative name": "Not a valid representative name",
  "Error Not a valid representative role": "Not a valid representative role",
  "Error Not a valid representative phone number": "Not a valid representative phone number",
  "Error Not a valid representative email address": "Not a valid representative email address",
  "Error Not a valid company name": "Not a valid company name",
  "Error Not a valid Companies House reference number": "Not a valid Companies House reference number",
  "Error Not a valid charity, organisation or trust name": "Not a valid charity, organisation or trust name",
  "Error Not a valid charity number": "Not a valid charity number",
  "Error Not a valid establishment phone number": "Not a valid establishment phone number",
  "Error Not a valid establishment email address": "Not a valid establishment email address",
  "Error You must select an establishment address type before continuing": "You must select an establishment address type before continuing",
  "Error You must select a trading status before continuing": "You must select a trading status before continuing",
  "Error Not a valid opening date": "Not a valid opening date",
  "Error You must select a customer type before continuing": "You must select a customer type before continuing",
  "Error You must select a valid import or export option(s) before continuing": "You must select a valid import or export option(s) before continuing",
  "Error You must select a business type before continuing": "You must select a business type before continuing",
  "Error You must select a water supply type before continuing": "You must select a water supply type before continuing",
  "Error Your message is too long. Please shorten it to less than 1500 characters": "Your message is too long. Please shorten it to less than 1500 characters",
  "Error Please select which days this establishment is open": "Please select which days this establishment is open",
  "Error Please describe when this establishment is open": "Please describe when this establishment is open",
  "Error Not a valid name": "Not a valid name",
  "Error You must select the main partnership contact before continuing": "You must select the main partnership contact before continuing",
  "Error Main partnership contact is not in the list of partners": "Main partnership contact is not in the list of partners",
  "Error Invalid opening hours on Monday": "Invalid opening hours on Monday",
  "Error Invalid opening hours on Tuesday": "Invalid opening hours on Tuesday",
  "Error Invalid opening hours on Wednesday": "Invalid opening hours on Wednesday",
  "Error Invalid opening hours on Thursday": "Invalid opening hours on Thursday",
  "Error Invalid opening hours on Friday": "Invalid opening hours on Friday",
  "Error Invalid opening hours on Saturday": "Invalid opening hours on Saturday",
  "Error Invalid opening hours on Sunday": "Invalid opening hours on Sunday",
  "Error You have entered an invalid number of partners or a duplicate partner name. Please define between 2-5 partners, using initials or middle name to ensure that each entry is unique.": "You have entered an invalid number of partners or a duplicate partner name. Please define between 2-5 partners, using initials or middle name to ensure that each entry is unique."
}
